# ---- taskviews ----

taskviews <- ctv::available.views(repos = "https://cran.rstudio.com/")

topic <- vapply(taskviews, 
                function(x) x[['topic']],
                character(1))

amount <- vapply(taskviews,
             function(x) nrow(x[['packagelist']]),
             integer(1))

taskviews <- data.frame(topic,
           amount,
           stringsAsFactors = F)

taskviews$russ <- c(
  "Байесовский вывод",
  "Хемометрика",
  "Клинические тесты",
  "Кластерный анализ",
  "Диффуры",
  "Распределения",
  "Эконометрика",
  "Экология",
  "Эксперименты",
  "Эмирические финансы",
  "Стат.генетика",
  "Визуализация",
  "Параллельные выч.",
  "Машинное обучение",
  "Медицинская визуализация",
  "Мета-анализ",
  "Многомерная статистика",
  "Естественный язык",
  "Вычислит. математика",
  "Офиц.статистика",
  "Оптимизация",
  "Фармакокинетика",
  "Филогенетика",
  "Психометрика",
  "Воспроизводимость",
  "Робастные методы",
  "Социальные науки",
  "Пространственные данные",
  "Простр.-временные данные",
  "Выживаемость",
  "Временные ряды",
  "Веб-технологии",
  "Теория графов")

library(ggvis)
taskviews %>% 
  ggvis(~amount, ~reorder(russ, -amount)) %>% 
  layer_points() %>% 
  add_axis("x", title = "Количество расширений R по тематике") %>% 
  add_axis("y", title = "")